stressTest.yml
config:
  target: 'http://ec2-18-218-54-252.us-east-2.compute.amazonaws.com:8081'
  phases:
    # - duration: 60
    #   arrivalRate: 1
    #   name: '1 rps'
    # - duration: 60
    #   arrivalRate: 10
    #   name: '10 rps'
    # - duration: 60
    #   arrivalRate: 100
    #   name: '100 rps'
    - duration: 60
      arrivalRate: 1000
      name: "1000 rps"
  defaults:
    # headers:
    #   x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      # - get:
      #     url: '/api/features/{{$randomNumber(9000000,10000000)}}'
      - post:
          url: '/api/features/'
          json:
            aboutHeader: "{{'testString'}}"
            aboutBody: "{{'testString'}}"
            featuresTitle: "{{'testString'}}"
            features: "{{'testString'}}"